# 41. Create a table in SQL(MySQL Database) from python dictionary


[Python convert normal JSON to JSON separated lines 3 examples](https://blog.softhints.com/python-convert-json-to-json-lines/)

* Pandas DataFrame to MySQL
* Create table from Python Dict
* connect MySQL database and Python
    * SQLAlchemy
    * PyMySQL

Python dict which is converted to a Database Table

```json
{"id":1,"label":"A","size":"S"}
{"id":2,"label":"B","size":"XL"}
{"id":3,"label":"C","size":"XXl"}
```

## Step 1: Read/Create a Python dict

In [1]:
import pandas as pd

# read normal JSON with pandas
df = pd.read_json('/home/vanx/Downloads/old/normal_json.json')

df.head()

   id label size
0   1     A    S
1   2     B   XL
2   3     C  XXl

In [4]:
data_dict = df.to_dict()
data_dict

{'id': {0: 1, 1: 2, 2: 3},
 'label': {0: 'A', 1: 'B', 2: 'C'},
 'size': {0: 'S', 1: 'XL', 2: 'XXl'}}

In [5]:
df2 = pd.DataFrame.from_dict(data_dict)
df2.head()

   id label size
0   1     A    S
1   2     B   XL
2   3     C  XXl

## Step 2: Pandas DataFrame to MySQL table with SQLAlchemy

In [6]:
# connect
from sqlalchemy import create_engine
cnx = create_engine('mysql+pymysql://test:pass@localhost/test')

In [7]:
# create table from DataFrame
df.to_sql('test', cnx, if_exists='replace', index = False)

In [8]:
# query table
df = pd.read_sql('SELECT * FROM test', cnx)
df.head()

   id label size
0   1     A    S
1   2     B   XL
2   3     C  XXl

## Step 3: Python Dict Insert Records Into a MySQL Database

In [18]:
# connect
import pymysql

connection = pymysql.connect(host='localhost',
                             user='test',
                             password='pass',
                             db='test')
cursor = connection.cursor()

In [19]:
# Create table
cols = df.columns
table_name = 'test'
ddl = ""
for col in cols:
    ddl += "`{}` text,".format(col)

sql_create = "CREATE TABLE IF NOT EXISTS `{}` ({}) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;".format(table_name, ddl[:-1])
cursor.execute(sql_create)

0

In [20]:
# insert data
cols = "`,`".join([str(i) for i in df.columns.tolist()])

# insert dict records .
for i,row in df.iterrows():
    sql = "INSERT INTO `test` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cursor.execute(sql, tuple(row))
    connection.commit()

In [21]:
# read
sql = "SELECT * FROM test"
cursor.execute(sql)
result = cursor.fetchall()
for i in result:
    print(i)

('1', 'A', 'S')
('2', 'B', 'XL')
('3', 'C', 'XXl')